#include <iostream>

//  На следващият ден, Мишо има тест по математика в училище (той е 12ти клас). 
//  След тежката му вечер, той има тежък махмурлук и математиката му куца. 
//  Той ще се нуждае от вашата помощ за няколко еднотипни задачи. 
//  При тях се приемат 3 реални числа и трябва да се разбере какъв ще е знака на произведението им. 
//  Тъй като Мишо не разбира много от каквото и да е, той иска вие да направите програмата така че 
//  да разбирате какъв е знака без да намирате произведението на числата.

int main()
{
	double firstNumber = 0;
	std::cin >> firstNumber;

	double secondNumber = 0;
	std::cin >> secondNumber;

	double thirdNumber = 0;
	std::cin >> thirdNumber;

	int i = 0;

	if (firstNumber < 0) {
		i++;
	}
	if (secondNumber < 0) {
		i++;
	}
	if (thirdNumber < 0) {
		i++;
	}

	if (i % 2 == 0) {
		std::cout << '+' << std::endl;
	}
	else {
		std::cout << '-' << std::endl;
	}
}