#include <iostream>

//Мишо е редовно пиянде.Един ден той решава с неговите приятели да отидат на дискотека.
// Тъй като охраната се подкупва лесно с едни къси 20 лева, 
// шефката на Eleven решава да имплементира система, която проверява дали някой е пълнолетен.
// Системата сканира личната карта и праща данните.Вашата задача е да приемете годините(естествено число; 
// пресметнати преди това от друга система) и да отпечатате дали някой от приятелите на Мишо може да влезне.
// За да може някой да влезне, той трябва да е пълнолетен(на или над 18).
//Примери
//  		Вход 	Изход
//1 		20 	Happy Misho
//2 		17 	Sad Misho
//3 		18 	Happy Misho

int main()
{
    int age = 0;
    std::cin >> age;

    if (age < 18) {
        std::cout << "Sad Misho" << std::endl;
    }
    else {
        std::cout << "Happy Misho" << std::endl;
    }
}

